{"id":4495,"date":"2023-07-24T17:02:08","date_gmt":"2023-07-24T11:32:08","guid":{"rendered":"https:\/\/newwebsite.nestdigital.com\/?p=4495"},"modified":"2023-08-05T16:11:39","modified_gmt":"2023-08-05T10:41:39","slug":"all-about-self-driving-cars","status":"publish","type":"post","link":"https:\/\/nestdigital.com\/blogs\/all-about-self-driving-cars\/","title":{"rendered":"All About Self-Driving Cars"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\" id=\"7228\">INTRODUCTION<\/h2>\n\n\n\n<p id=\"7228\">Self-driving cars- It seems like a concept from the future or a sci-fi movie. But this future is right around the corner. We are heading into a future, where we can let our cars drive us to our destination. There is a lot of hype around self-driving cars and Global tech giants are making significant strides in technologies that will make fully autonomous vehicles a reality.&nbsp;<br>Self-driving cars or autonomous vehicles are vehicles that can sense their environment and operate without human intervention. A human need not take control of the vehicle or be present at all times. There are several types depending on the levels of automation.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"d45b\">LEVELS OF AUTOMATION<\/h2>\n\n\n\n<p id=\"d45b\">There are currently 6 levels of Automation, as per the Society of Automotive Engineers (SAE), ranging from Level 0 to Level 5. As the levels increase, the extent of automation increases accordingly.&nbsp;<br><br>•&nbsp;<em>Level 0:<\/em>&nbsp;Most vehicles that we see on the road are at Level 0. That is, a human does the driving without any assistance. Example: Ford Model T&nbsp;<\/p>\n\n\n\n<p id=\"d45b\"><br>•&nbsp;<em>Level 1<\/em>&nbsp;(Driver Assistance): This level incorporates the lowest level of automation, with the vehicle controlling at least one function such as cruise control or emergency brake assistance. Example: Cruise Control Feature&nbsp;<\/p>\n\n\n\n<p id=\"d45b\"><br>•&nbsp;<em>Level 2<\/em>&nbsp;(Partial Automation): It applies to vehicles with Advanced Driver Assistance Systems. The vehicle would control more than one autonomous function such as steering and accelerating. Yet, at this level, it is required the driver should remain alert and engaged at all times. Eg: Tesla Autopilot&nbsp;<\/p>\n\n\n\n<p id=\"d45b\"><br>•&nbsp;<em>Level 3<\/em>&nbsp;(Conditional Automation): The automated driving system has environment detection capability and can perform tasks but it is still required for the human to be in control. Eg: Uber Self-Driving Car.&nbsp;<\/p>\n\n\n\n<p id=\"d45b\"><br>•&nbsp;<em>Level 4<\/em>&nbsp;(High Automation): This level is referred to as High Driving Automation. Vehicles at this level can operate in self-driving mode. It can monitor the surroundings and the ADS (Automated Driving System) is reliable to such an extent that the human driver need not pay attention. Eg: Waymos Autonomous Vehicle&nbsp;<\/p>\n\n\n\n<p id=\"d45b\"><br>•&nbsp;<em>Level 5<\/em>&nbsp;(Full Automation): These are Fully Autonomous vehicles that do not require any human intervention at all. These vehicles are undergoing testing in many different parts of the world. Since these vehicles require no human input, Prototypes of fully autonomous vehicles have no steering wheel or pedals.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"5454\">ADVANTAGES OF AUTONOMOUS VEHICLES<\/h2>\n\n\n\n<p id=\"5454\"><strong>Reduces Accidents<\/strong>: 90 percent of most road accidents are due to human error. Autonomous Vehicles are a game-changer in this regard. They are much safer since they are not affected by illness or fatigue. These vehicles are attentive and are constantly scanning in multiple directions.<\/p>\n\n\n\n<p id=\"524e\"><strong>Access for the elderly and physically disabled<\/strong>: Fully Autonomous vehicles would require no human intervention hence self-driving vehicles will be all-inclusive.<\/p>\n\n\n\n<p id=\"a005\"><strong>Effective taxis<\/strong>: Autonomous Vehicles are advantageous for the public transportation sector and they can also be used effectively as Robo taxis.It is estimated that the waiting time for a taxi will come down from 5 minutes to 36 seconds.<\/p>\n\n\n\n<p id=\"c083\"><strong>Traffic Efficiency<\/strong>: Autonomous Vehicles have been shown to reduce traffic congestion and improve traffic capacity. This, in turn, can reduce travel time and cut down transportation costs.<\/p>\n\n\n\n<p id=\"455d\"><strong>Decreases environmental pollution<\/strong>: Reduced Traffic Congestion will lead to reduced carbon dioxide emissions.<\/p>\n\n\n\n<p id=\"3e85\"><strong>Efficient Parking<\/strong>: Autonomous Vehicles eliminate the need for parking. The passengers will be dropped off at the location and the vehicle would park away from the location- somewhere space is available.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"3e85\">CHALLENGES IN THE ADOPTION OF AUTONOMOUS VEHICLES<\/h2>\n\n\n\n<p><strong>Accident Liability<\/strong>: Who would be responsible for accidents caused by self-driving cars. Would it be the passenger or the car manufacturer? In cases where self-driving requires the presence of a driver, the driver would be responsible, even if the car was driving itself. On the other hand, for Fully Autonomous vehicles, the liability for accidents would fall on the car manufacturer and software designer. Since this technology is new, lawsuits related to driverless cars are analysed case by case.&nbsp;<br><br><strong>Weather<\/strong>: Bad weather such as snow, heavy rain or fog makes it challenging for the vehicle’s sensors to function properly. In such a situation, passenger safety is impacted. In the future, technology can overcome these challenges.&nbsp;<br><br><strong>Cybersecurity<\/strong>: Data privacy is a major concern and consumers’ data must be protected from hackers. Cybersecurity should be strengthened to safeguard consumer data transmitted through a cloud-based platform.<\/p>\n\n\n\n<p id=\"8db9\"><strong>Road Conditions<\/strong>: The condition of roads is unpredictable. It differs from place to place, with it being perfect in one place but deteriorating elsewhere. For example Lack of lane Markings, potholes, and tunnel roads may create a problem for Autonomous Vehicles.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"5d98\">HOW DO SELF-DRIVING CARS SEE<\/h2>\n\n\n\n<p id=\"5d98\">Self-driving cars are highly technologically advanced. They work with a combination of both hardware and software to navigate their environment.<\/p>\n\n\n\n<p id=\"9612\"><strong>RADAR<\/strong>&nbsp;(Radio Detection and Ranging)- Radar can detect objects despite adverse weather conditions since it consists of radio waves. It ensures that the vehicle can obtain details on the object’s range and velocity.<br><br><strong>LIDAR<\/strong>&nbsp;(Light Detection and Ranging) enables vehicles to scan their surroundings with lasers. It helps vehicles detect even the smallest objects with high precision. They can calculate the distance to objects by measuring the time it takes for the reflected light beam to fall on a photodetector and create a detailed 3D map of the surroundings. However, it is unreliable in adverse weather conditions.<br><br><strong>CAMERA<\/strong>&#8211; High-resolution digital cameras can visualize the environment. Computer vision takes various input data such as video segments and camera images from different angles. Tesla cars have 8 external cameras.<br><br>In addition to the above, ultrasonic sensors and inertial sensors are used. Self-driving cars need immense processing power, hence they leverage Graphical Processing Units (GPUs) as well.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"9612\">HOW DO THEY WORK<\/h2>\n\n\n\n<p id=\"9612\">Autonomous cars consist of numerous sensors that collect input data. This input data is processed with machine learning algorithms. In addition, neural networks can detect patterns in data. The more the data, the better the self-driving algorithms get.<br><br><strong>Map Building<\/strong>: The vehicles create a map of the surroundings by combining input from sensors and digital maps. They plan routes based on these inputs to reach the destination.<br><br><strong>Planning a Path<\/strong>: The vehicle plans a path that is the quickest route to the entered location. It takes into account not only navigation but also static and dynamic obstacles.<br><br><strong>Avoiding Obstacles<\/strong>: The vehicles can avoid all static and dynamic objects. Utilizing Machine Learning it detects the identity of certain objects. This helps it to know its predicted behavior. Certain other objects are hidden and not scannable by the vehicle. Hence self-driving cars will constantly be in communication with each other. If one vehicle encounters an object, other vehicles are also alerted.<br><br>Some real-world examples of self-driving cars are Tesla Autopilot, Waymo, and Roborace.<\/p>\n\n\n\n<p id=\"88b4\"><strong>WRAPPING UP<\/strong><br>Researchers estimate that self-driving cars will become common by 2030 and have the potential to replace other vehicles by the year 2050. It will revolutionize the transportation industry and in turn, our daily lives. In conclusion, Autonomous driving will open up endless possibilities and will enable us to reimagine mobility.&nbsp;<br><br><strong>REFERENCES<\/strong>:&nbsp;<br>1.<a rel=\"noreferrer noopener\" href=\"https:\/\/www.techtarget.com\/searchenterpriseai\/definition\/driverless-car\" target=\"_blank\">https:\/\/www.techtarget.com\/searchenterpriseai\/definition\/driverless-car<\/a><br>2.<a rel=\"noreferrer noopener\" href=\"https:\/\/interestingengineering.com\/how-do-self-driving-cars-work\" target=\"_blank\">https:\/\/interestingengineering.com\/how-do-self-driving-cars-work&nbsp;<\/a><br>3.<a rel=\"noreferrer noopener\" href=\"https:\/\/history-computer.com\/self-driving-cars-guide\/\" target=\"_blank\">https:\/\/history-computer.com\/self-driving-cars-guide\/&nbsp;<\/a><br>4.<a rel=\"noreferrer noopener\" href=\"https:\/\/www.iotforall.com\/how-do-self-driving-cars-work\" target=\"_blank\">https:\/\/www.iotforall.com\/how-do-self-driving-cars-work<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>INTRODUCTION Self-driving cars- It seems like a concept from the future or a sci-fi movie. But this future is right around the corner. We are heading into a future, where we can let our cars drive us to our destination. There is a lot of hype around self-driving cars and Global tech giants are making [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":5661,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":"","wds_primary_category":16},"categories":[16],"tags":[35],"blocksy_meta":"","_links":{"self":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts\/4495"}],"collection":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/comments?post=4495"}],"version-history":[{"count":0,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts\/4495\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/media\/5661"}],"wp:attachment":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/media?parent=4495"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/categories?post=4495"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/tags?post=4495"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}