{"id":4501,"date":"2023-07-24T17:23:59","date_gmt":"2023-07-24T11:53:59","guid":{"rendered":"https:\/\/newwebsite.nestdigital.com\/?p=4501"},"modified":"2023-08-05T16:16:09","modified_gmt":"2023-08-05T10:46:09","slug":"ecall","status":"publish","type":"post","link":"https:\/\/nestdigital.com\/blogs\/ecall\/","title":{"rendered":"eCall"},"content":{"rendered":"\n<p id=\"9b40\">Have you ever noticed the SoS button in the new generation cars? Have you thought about the benefits of the “internet-enabled” cars apart from the integrated maps and the fancy features explained by executives? Here is a feature or technology that comes helpful for a passenger — eCall or Emergency Call.<\/p>\n\n\n\n<p id=\"cd52\">For any vehicle, if it is in running condition, we should think about the possibility of an emergency. If there is an emergency, be it an accident or an intruder or a medical condition, or any possibility you can think about, where the passengers are unable to get the vehicle to a safe place, it will be of great relief if a supporting team can reach the place with the required help. eCall is developed to handle such situations.<\/p>\n\n\n\n<p id=\"56d2\">The cellular connectivity to place the eCall and GPS connectivity to access the vehicle location are the main requirements for a vehicle to implement eCall. This is a mandatory feature for vehicles in many countries and there are specifications defined for eCall.<\/p>\n\n\n\n<p id=\"7065\">eCall is designed in such a way that it can be triggered automatically when there is an accident, by sensing the deployment of airbags or by pressing the SoS button manually if the emergency is of any other sort. Other than the trigger initiation, both eCall work in the same way.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*Z1Uor9DWm8rZJZWTSpyOGw.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">eCall overview (Source: European Commission)<\/figcaption><\/figure>\n\n\n\n<p id=\"f28a\">The participants of an eCall are a vehicle, a circuit-switched cellular network, and a Public Safety Answering Point (PSAP).<\/p>\n\n\n\n<p id=\"54d7\">In the event of an emergency, the eCall system manually or automatically triggers an emergency voice call between the passenger and the Public Safety Answering Point(PSAP) accessible through widely spread emergency numbers and often accessible through fixed and mobile telephone — 112 in Europe, 911 in the United States. Apart from this the system also transfers a data message from the Vehicle to PSAP which is denoted as eCall Minimum Set of Data(MSD). The MSD includes location information, time stamp, number of passengers (with reference to number of engaged seat belts), driving direction, vehicle Identification Number (VIN), and other relevant information.<\/p>\n\n\n\n<p id=\"37e1\">The operator at the PSAP will be able to set up a voice call with the vehicle and talk to the passengers and verify the exact problems so that the appropriate measures can be taken to inform the ambulance or police.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"e705\"><strong>Technical aspects of eCall implementation:<\/strong><\/h2>\n\n\n\n<p id=\"be91\">The major specifications that are to be considered when developing an eCall solution are:<\/p>\n\n\n\n<ol>\n<li>EN 16072 (Pan-European eCall operating requirements)<\/li>\n\n\n\n<li>EN 16062 (eCall high-level application requirements (HLAP) using GSM\/UMTS circuit-switched networks)<\/li>\n\n\n\n<li>EN 15722 (ECall minimum set of data)<\/li>\n\n\n\n<li>EN 16454 (End-to-End Conformance Testing requirements)<\/li>\n<\/ol>\n\n\n\n<p id=\"187b\">You can derive the requirements and validate them against these specifications so that it will be easier when the conformance testing is done.<\/p>\n\n\n\n<p id=\"3933\">The challenge in developing an eCall application is that there are very strict timing requirements for communicating with PSAP and all these requirements shall be met to get the solution certified. Both hardware and software-integrated solution is the best way to achieve this.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever noticed the SoS button in the new generation cars? Have you thought about the benefits of the “internet-enabled” cars apart from the integrated maps and the fancy features explained by executives? Here is a feature or technology that comes helpful for a passenger — eCall or Emergency Call. For any vehicle, if [&hellip;]<\/p>\n","protected":false},"author":7,"featured_media":5663,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":"","wds_primary_category":16},"categories":[16],"tags":[35],"blocksy_meta":"","_links":{"self":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts\/4501"}],"collection":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/users\/7"}],"replies":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/comments?post=4501"}],"version-history":[{"count":0,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts\/4501\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/media\/5663"}],"wp:attachment":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/media?parent=4501"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/categories?post=4501"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/tags?post=4501"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}