{"id":4511,"date":"2023-07-24T20:37:34","date_gmt":"2023-07-24T15:07:34","guid":{"rendered":"https:\/\/newwebsite.nestdigital.com\/?p=4511"},"modified":"2023-08-12T18:19:21","modified_gmt":"2023-08-12T12:49:21","slug":"the-d-dt-of-ev-charging","status":"publish","type":"post","link":"https:\/\/nestdigital.com\/blogs\/the-d-dt-of-ev-charging\/","title":{"rendered":"The d\/dt of EV Charging"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\" id=\"eaf1\"><strong>Abstract<\/strong><\/h2>\n\n\n\n<p id=\"f9b9\">Slow charging time, along with other hurdles like range anxiety, has been plaguing EV adoption for many years now. While charging overnight from AC mains supply at home is really slow, Fast DC chargers at the roadside and along highways help charge the car battery within a reasonable time. Charging time depends on multiple variables, such as the charging station’s power, battery capacity, charging capability of the car and ambient temperature. One needs to be careful in equalizing these variables while making comparisons to avoid ending up with inaccurate judgements. While the industry has responded with Fast chargers and innovations in Ultra-Fast charging technologies, battery designs haven’t quite kept pace. High costs of installation and charging, widespread compatibility issues across EVs and the potential impact on battery life have been blockers in a resolution to the charging time problem.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"af58\"><strong>Introduction<\/strong><\/h2>\n\n\n\n<p id=\"ac20\">How would you react when told that your electric car could now charge fully in only a few minutes! Or, if you don’t have an EV already, is the charging time a mental block for considering buying one? Well, the solution may just have arrived. Announced by ABB in the fall of 2021 as the world’s fastest electric car charger, the Terra360 fully charges an electric car in under 15 minutes!<\/p>\n\n\n\n<p id=\"bc37\">Generations of petrol\/diesel car users have enjoyed fill up times of only a few minutes. Even a fill up from empty to full tank takes hardly 5–10 minutes. Whereas users of electric cars (both pluggable hybrid and battery electric) have learned to wait patiently for at least an hour or more after hooking up the car to a public charging station for getting fully charged — a stark contrast, indeed! For instance, the Tata Nexon EV specifies around 60 minutes to charge from 10% to 80% from a Fast DC charger, as an acquaintance of mine confirms with his 2 years old model. While Hyundai Kona EV specifies 0% to 80% in 57 minutes. “Why only 80%, why not 100%” would be the natural question, which we will address a bit later. (*)<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"bc90\"><strong>Charging levels<\/strong><\/h2>\n\n\n\n<p id=\"f392\">The stereotype of charging at a public charging station is technically called Level-3 charging, or more commonly as Fast Charging. However, this isn’t the only way of charging. An electric car could be charged at home as well although much more slowly, a convenience that petrol\/diesel car users never had. Charging from an AC charger located in the garage or parking lot from a power socket of 15–16A rating, that would typically take 7–10 hours for a full charge, is technically called Level-2 charging. For instance, the Tata Nexon EV specifies around 9 hours 10 minutes to charge from 10% to 90% from a 15A AC socket, which was confirmed by the same acquaintance. While Hyundai Kona EV specifies around 6 hours for 0% to 100% charge. This way is ideal for overnight charging.<\/p>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:450\/1*Bo6jPI0qzkrxm08lZIgcTw.jpeg\" alt=\"\"\/><figcaption class=\"wp-element-caption\"><br><\/figcaption><\/figure>\n\n\n\n<p class=\"has-text-align-center\"><em>ABB Terra 54kW DC Fast Charger (Image courtesy: ABB)<\/em><\/p>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:142\/1*2vTEaG0zLVERFLnnYQXMwg.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\"><br><\/figcaption><\/figure>\n\n\n\n<p class=\"has-text-align-center\"><em>Schneider Electric “EVLink” 7.4kW AC Home Charger (Image courtesy: Schneider Electric)<\/em><\/p>\n\n\n\n<p id=\"d37b\">Slow charging from a domestic AC charger is not a concern for most users since it happens overnight, conveniently. But when it comes to charging at a public charging station, especially in the middle of a long journey at the roadside or along the highway, that is when the charging time becomes a serious concern. In fact, charging time is acknowledged as one of the adoption hurdles for most petrol\/diesel users thinking of switching over to electric. That is exactly where the likes of Terra360 deliver the knockout punch! (**)<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"8585\"><strong>Battery charge rate measurement<\/strong><\/h2>\n\n\n\n<p id=\"c5b8\">Let’s take a moment to peep under the hood to understand why electric charge won’t flow into a car battery as quickly as petrol\/diesel flows into the fuel tank, why even “fast” charging has been relatively slow! The Lithium Ion battery, the most prominent chemistry of today, charges at a fairly uniform rate (for example, 5% charge in every 4 minutes) up to a threshold of around 80%. Minor variations could exist in the threshold value across battery designs. Beyond that threshold, the last lap to 100% charge takes up almost the same amount of additional time. Incidentally that last lap isn’t desirable for Lithium Ion battery either.<\/p>\n\n\n\n<p id=\"3abf\">(*) That is why most manufacturers limit it to 80% charge while specifying charging time.<\/p>\n\n\n\n<p id=\"82c3\">Further, the rate of charging is a function of several variables like (but not limited to) power output of the charging station, the car’s battery capacity and the charging capability of the car. Ambient temperature also impacts charging rate, although to a lesser degree. So, while comparing charging times across different vehicle makes\/models, if one is not careful enough in equalizing most of the variables if not all, then one could end up with an unrealistic comparison.<\/p>\n\n\n\n<p id=\"35db\">For instance, the battery capacity could vary across EVs — like 30.2 kWh Li Ion battery for the Tata Nexon EV, versus 39.2 kWh Li Ion Polymer battery for the Hyundai Kona EV.<\/p>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*ahrcPFubtT5JmoEfOp3o1g.png\" alt=\"\"\/><\/figure>\n\n\n\n<p class=\"has-text-align-center\"><em>Electrical specifications (Courtesy: Tata Motors, Hyundai Corporation)<\/em><\/p>\n\n\n\n<p id=\"4cd7\">Similarly, without knowing whether the charger used was from Exicom or Delta Electronics and its power rating, a straight comparison between charging time measurements wouldn’t be a level playing field.<\/p>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:282\/1*xHmvgotVWrVfiCn1t_q5Ew.png\" alt=\"\"\/><\/figure>\n\n\n\n<p class=\"has-text-align-center\">Delta Electronics 200kW Fast DC Charger (Image courtesy: Delta Electronics)<\/p>\n\n\n\n<figure class=\"wp-block-image aligncenter\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:274\/1*0yWGiRPBCs8b346yqSDlQA.png\" alt=\"\"\/><\/figure>\n\n\n\n<p class=\"has-text-align-center\"><em>Exicom 240kW DC Fast Charger (Image courtesy: Exicom)<\/em><\/p>\n\n\n\n<p id=\"e9e2\">The charging capability of the EV is determined by its Battery Management System (BMS), which is the intermediary that accepts power from the charging station and ensures that the battery gets charged efficiently and safely. The BMS controls the rate at which the battery pack is charged, equalizing cell voltages and ensuring temperatures do not rise up dangerously. Since BMS of each make\/model vary in their characteristics, we can expect a resultant difference in charging rates, even with cars of the same battery capacity at the same charging station.<\/p>\n\n\n\n<p id=\"9424\">The State of Charge (SoC) or battery level before starting the charging operation has an obvious impact on the overall charging time. A battery would obviously take the longest time to fully charge when it in a fully discharged condition. To compensate for variations in the start SoC % and the end SoC % across different measurements, the metric “% charge added per charging time” or the charging rate (d\/dt), is found more useful. That means we consider only the middle range of charge between 10% (or 20%) and 80%, and we measure what % of the battery gets charged (on an average, across multiple measurements, on the same battery), in how many minutes of charging time. One could argue that “range added per charging time”, a range rate metric, as used by many OEMs is a better metric. For instance, delivering 160 km of range in 3 minutes of charging. However, the range rate metric would also include the overall efficiency of the EV itself, including that of its traction motor, transmission system, regenerative braking etc., and therefore it wouldn’t be an accurate metric of battery charging rate per se.<\/p>\n\n\n\n<p id=\"38a8\">So how are Fast Chargers tested before they get approval for public use? At SFO Technologies (the flagship company of NeST group), we test our 50kW DC Fast Charger design by simulating a car battery. Setting a (virtual) battery capacity of 30.2kWh (similar to Tata Nexon EV), it takes typically around 26 minutes to charge from 10% to 80% of (virtual) battery level. Since there is no real BMS in this test setup, this virtual d\/dt reading cannot be compared to the charging time of a real car battery. Certification by the Automotive Research Association of India (ARAI) is expected in Q2 of 2023, after which charging times with actual EVs, like Tata Nexon, Hyundai Kona etc. could be measured.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"c364\"><strong>Industry trends and issues<\/strong><\/h2>\n\n\n\n<p id=\"4445\">The industry has so far been approaching resolution of charging time by pushing steadily for Fast Charging and more recently Ultra-Fast Charging, led by the iconic Tesla superchargers. There are however a few issues involved, the first to hit users being the charging cost. Compared to the cost of AC charging, the average charging cost for the user increases 4 to 6-fold for Fast charging and even more for Ultra-Fast charging. Infrastructure costs for the charging operator are also considerably higher for Fast Charging stations, and even more so for Ultra-Fast Charging stations. The latter may need the input feeder power equivalent of 5–6 households given their huge power rating, for instance the Terra360 delivers a whopping 360kW!<\/p>\n\n\n\n<p id=\"c6bd\">(**) However, launches of the likes of Terra360 do not address the “prime accused” of all adoption hurdles — range anxiety! That is where the battery chemistry wars are being fought today for improving EV range. Another parallel approach ongoing is to improve the density of charging infrastructure and predictability of its location, availability and compatibility, especially in vast geographies like India.<\/p>\n\n\n\n<p id=\"65eb\">Another issue with Ultra-Fast Chargers is EV compatibility. Although Tesla eventually pivoted their proprietary super chargers to support the European standard (with CCS Combo2 outlet) in their European installations, the general compatibility across EV makes\/models is still very limited. While a few manufacturers like ABB and Tesla have been focused on steadily increasing the charging capacity of their charging stations, it remains a tall order for the highly fragmented EV and battery manufacturing segments, who have been lagging in making major breakthroughs in battery design, to absorb the high rate of energy efficiently as well as safely. As a result, a large spectrum of EVs continues to remain incompatible with these Ultra-Fast Chargers. So, although ABB Terra360 did launch in 2021, the day when you and I could get fully charged under 15 minutes no matter the make\/model of EV, is still a while in the future.<\/p>\n\n\n\n<p id=\"1714\">Finally, at the physical level Ultra-Fast charging involves large currents in the 400A — 500A range flowing through the charging cable\/connector that raises a lot of heat. Forced liquid cooling of the charging cables becomes mandatory, without which temperatures could shoot up dangerously. While occasional fast charging is generally considered safe for batteries, repeated fast charging (and ultra-fast charging) that elevates battery temperatures sharply and frequently, is known to be detrimental to the State of Health (SoH) or battery life. Given the imperfections of the BMS design, especially at extremes of ambient temperature or with mismatched cells, this has a potential to impact battery life.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"df90\"><strong>Consumer concerns<\/strong><\/h2>\n\n\n\n<p id=\"1b0b\">Incidentally, high battery cost is the next in line to “range anxiety” among the adoption hurdles. The battery subsystem cost today stands at almost half the cost of the EV or more. In a price-sensitive market such as India where the vast majority of consumers still view buying a car as a lifetime investment, and the maximum OEM battery warranty is still only around 8 years or 160000 kms, the prospect of depreciation of the EV at the end of battery life\/warranty is paralyzing! It is hardly surprising that even after several incentive schemes from different tiers of government, the much-awaited electric revolution is yet to flood a large market like India. And no wonder why the ABB Terra360 didn’t raise millions of eyebrows on the subcontinent!<\/p>\n\n\n\n<p id=\"5155\"><strong>Conclusion<\/strong><\/p>\n\n\n\n<p id=\"c248\">In conclusion, the cost of fast charging which depends on the utility tariffs and pricing plans set by charging infrastructure operators may eventually start to come down as demand picks up as well as density of charging infrastructure gets better. As Ultra-Fast charging technologies get more impetus from charger manufacturers, compatibility across EVs would probably continue to lag for some more time, since advances in battery design would take an independent cycle time to achieve. Meanwhile, the temperature and safety issues of Ultra-Fast chargers associated with the transfer of very high power will need to be assured for quick uptake among operators. Going by the industry’s pace of innovation in fast charging technologies, could the day be far off when one is not quite sure which one charges faster — a smartphone or an electric car!<\/p>\n\n\n\n<p id=\"be2d\"><a href=\"https:\/\/medium.com\/tech-blogs-by-nest-digital\/demystifying-data-mesh-9a34ad69108f?source=author_recirc-----7f677cc6ad74----1---------------------26e9a463_7e86_478c_b25a_ca475df1167f-------\"><\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Abstract Slow charging time, along with other hurdles like range anxiety, has been plaguing EV adoption for many years now. While charging overnight from AC mains supply at home is really slow, Fast DC chargers at the roadside and along highways help charge the car battery within a reasonable time. Charging time depends on multiple [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":4512,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":"","wds_primary_category":16},"categories":[16],"tags":[35],"blocksy_meta":"","_links":{"self":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts\/4511"}],"collection":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/comments?post=4511"}],"version-history":[{"count":1,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts\/4511\/revisions"}],"predecessor-version":[{"id":6803,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts\/4511\/revisions\/6803"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/media\/4512"}],"wp:attachment":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/media?parent=4511"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/categories?post=4511"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/tags?post=4511"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}