{"id":4524,"date":"2023-07-25T22:36:29","date_gmt":"2023-07-25T17:06:29","guid":{"rendered":"https:\/\/newwebsite.nestdigital.com\/?p=4524"},"modified":"2023-08-05T16:09:33","modified_gmt":"2023-08-05T10:39:33","slug":"hello-mr-ev-charger-im-a-flat-car-battery-part-1","status":"publish","type":"post","link":"https:\/\/nestdigital.com\/blogs\/hello-mr-ev-charger-im-a-flat-car-battery-part-1\/","title":{"rendered":"“Hello Mr. EV Charger, I’m a flat car battery!” (Part-1)"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\" id=\"fd1e\"><strong>Abstract<\/strong><\/h2>\n\n\n\n<p id=\"f33b\">Electric car users need to frequently recharge the traction battery, and while doing so they need to be assured of an efficient, safe and interoperable experience, be it AC charging or DC charging. EV Charging standards assure users that they can charge their car from any compatible EV Charger. Apart from electrical protection that is mandated by regulations to handle an untoward safety situation, bidirectional communication in real time between the EV Charger and the car is required throughout the charging session to ensure that the charging capabilities and limitations are mutually understood and any mismatches and unsafe conditions are proactively avoided. Protocol standards for EVSE-EV communication enable the EV Charger and the car to talk to each other towards fulfilling this objective.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"84de\"><strong>Introduction<\/strong><\/h2>\n\n\n\n<p id=\"e7a7\">Ever wondered how an EV Charger knows what current to charge the car battery at? Contrast this with filling up a petrol\/diesel car. Is filling up at different rates of fuel flow even relevant! We know liquid fuel is always pumped at the same flow rate, no matter which model and irrespective of whether the tank is empty or near-full.<\/p>\n\n\n\n<p id=\"9ec9\">Further, how does the EV Charger know how much time to charge the battery? In other words, how does it know when exactly to stop charging? In contrast, in a petrol\/diesel pump a simple mechanism consisting of an auxiliary sensing tube mounted on the nozzle along with a mechanical valve based on venturi effect (based on pressure difference of the fluid at either end) is employed for automatic cut off of fuel flow when the tank is full. The same mechanism could also be activated manually to stop filling while looking at a particular readout on the fuel meter, or for a pre-set quantity.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"9ebe\"><strong>Communication, for intelligence beyond power transfer<\/strong><\/h2>\n\n\n\n<p id=\"42f0\">From these differences it is obvious that the EV Charger (and the electric car itself) need to have much more intelligence compared to their fossil fuel counterparts. Welcome to the lesser known world of EVSE-EV communications! (Where EVSE stands for Electric Vehicle Supply Equipment which is the terminology for EV Charger, and EV refers to the car.)<\/p>\n\n\n\n<p id=\"e1b9\">Now that the “WHYs” of EVSE-EV communication are amply illustrated, let’s see “HOW” exactly the communication happens, and over what medium. If you’re an EV user, you would have used the charging gun of an EV Charger already by plugging it into your car’s inlet to charge. Take a closer look at the charging connector — although the primary purpose of the connector design is to transfer electric power, a few additional pins (apart from the power pins) are provided for communication. Let’s zoom in on the charging gun of the Combined Charging System 2 (CCS2) (group of) standard(s), that is predominant in Europe and has also been adopted in India, and their connector pinouts. Firstly, the CCS2 AC Charging connector.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"cd47\"><strong>EVSE-EV Communication (AC Charging Connector)<\/strong><\/h2>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*mbCyB0tXg4NkL6s8pnTQBw.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">AC Connector Pinout<\/figcaption><\/figure>\n\n\n\n<p id=\"cbf1\">As we can see in the above 2 pictures, out of the 7 pins provided in the AC connector, 4 are reserved for (1Phase\/3Phase) AC power transfer — Phase1 (R), Phase2 (Y), Phase3 (B) and Neutral. Whereas, 3 pins are dedicated for EVSE-EV communication — Control Pilot (CP), Proximity Pilot (PP) and Protective Earth (PE), which forms the ground reference.<\/p>\n\n\n\n<p id=\"280d\">Now, the CCS2 DC Charging connector.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"35ad\"><strong>EVSE-EV Communication (DC Charging Connector)<\/strong><\/h2>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*GkUAS5rkbv1YorEMAxBy2w.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">DC Connector Pinout<\/figcaption><\/figure>\n\n\n\n<p id=\"331c\">As we can see in the above 2 pictures, out of the 5 pins provided in the DC connector, 2 are reserved for DC power transfer — DC + and DC -. Whereas, 3 pins are dedicated for EVSE-EV communication — Control Pilot (CP), Proximity Pilot (PP) and Protective Earth (PE), which forms the ground reference.<\/p>\n\n\n\n<p id=\"30ed\">As we can see, these communication pins have quaint names — Control Pilot (CP) and Proximity Pilot (PP). The CP pin is used for most of the signalling related to electrical power transfer, whereas the PP pin provides feedback on whether the car is currently plugged in or not. The Protective Earth (PE) pin acts as the ground reference for the other 2 signals.<\/p>\n\n\n\n<p id=\"c54a\">CCS2 also has the Combo plug, that includes power pins for both AC and DC charging in the same connector. However, the communication pinout (CP, PP and PE) remains the same as described above, in position as well as in function.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"5ccd\"><strong>EVSE-EV Communication (Combo Connector)<\/strong><\/h2>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*p31N2xSbUh7cMlsK2RF1BQ.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Combo Connector Pinout<\/figcaption><\/figure>\n\n\n\n<p id=\"fce5\"><strong>Note:<\/strong>&nbsp;In other popular EV Charging standards, like CCS1\/SAEJ1772 (US), CHAdeMO (Japan), GB\/T (China) and Tesla (global), the pin names, positions and electrical function may vary across each other, but a few dedicated pins are always provided for communication.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"fce5\"><strong>Types of EVSE-EV communication<\/strong><\/h2>\n\n\n\n<p>Two types of communication are possible between the EV Charger and the car. For the CCS2 system, these are:<br>1. Analog Signalling (AS), defined by the IEC61851 standard (the successor of the US SAE J1772)<br>2. High Level Communication (HLC), defined by the ISO15118 standard (the successor of the German DIN SPEC 70121, that covers only DC Charging)<\/p>\n\n\n\n<p id=\"dd8a\">Analog Signalling is the elementary communication mechanism between the EV Charger and the car over dedicated signal lines. Whereas HLC implements digital message communication to implement additional (and a few optional) functionality. In this (first) part, we take a closer look at how Analog Signalling works. In the next (second) part, we will deep dive into High Level Communication.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"c27a\"><strong>Analog Signalling<\/strong><\/h2>\n\n\n\n<p id=\"9d20\">Analog Signalling as the name indicates, employs electronic circuitry on the EV Charger and on the car for generating as well as detecting specific voltage levels and wave patterns (having specific timing characteristics) across specific signal lines. Analog Signalling protocol is defined by the IEC 61851 standard (Electric Vehicle Conductive Charging System) that defines the levels of voltages and currents, modes of charging, connectors and safety aspects for both AC Charging and DC Charging.<\/p>\n\n\n\n<p id=\"ff1e\">The 2 specific pins used for Analog Signalling are Control Pilot (CP) and Proximity Pilot (PP), with the Protective Earth (PE) pin acting as the ground reference. The pilot signal generated by the EV Charger is a +12V to -12V square wave at 1000Hz.<\/p>\n\n\n\n<p id=\"8297\">Discrete voltage levels or waveforms on the Control Pilot line represent different states to the EV Charger and the car. The duty cycle of the square wave itself represents the current that will be transferred in the current charging session. The following table captures the discrete voltage levels and waveforms on the CP line and the interpretation of each electrical pattern by the EV Charger.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*OZX3bVvOQFhMQ74ZSuTmVQ.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Analog Signalling States<\/figcaption><\/figure>\n\n\n\n<p id=\"2801\">(*) PWM — Pulse Width Modulation, a standard method of varying the pulse width of a square wave.<\/p>\n\n\n\n<p id=\"3796\">(**) Ventilation — This is typically not required for Lithium Ion batteries of today. It is only a carry-over left in the protocol from the Lead Acid battery days, which needed active ventilation to dissipate hazardous gases emitted during charging. If the EV Charger is located in an enclosed area, an exhaust fan is typically turned on.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"88fb\"><strong>Example scenarios<\/strong><\/h2>\n\n\n\n<p id=\"b835\">Let us look at a few communication scenarios involving Analog Signalling. For instance, when the EV Charger sees +12V DC on the Control Pilot line, it knows that the car is not yet plugged in, so it waits. As soon as the voltage drops to +9V DC, it knows that the car is plugged in. Internally the car presents a specified resistance when it is plugged in, that causes this voltage drop\/transition.<\/p>\n\n\n\n<p id=\"f756\">Similarly, when the EV Charger sees that its pilot signal that was a +12V to -12V square wave at 1000Hz, is now having the positive side chopped down at +9V (due to the resistance presented by the car), with the negative side still at -12V, it knows that the car that is plugged is preparing to receive power, but not yet ready. As soon as the positive side gets further chopped down to +6V (due to increased resistance presented by the car), with the negative side still at -12V, it knows that the car is now ready to receive power. In response to this state transition, the EV Charger closes the output contactor thereby connecting electrical power to the car.<\/p>\n\n\n\n<p id=\"e969\">From this, we can infer how the EV Charger knows when to stop charging. In this case the wave pattern would changes from a +6V to -12V square wave, back to a +9V to -12V square wave (due to decrease in the resistance presented by the car). In response to this state transition, the EV Charger opens the output contactor thereby disconnecting electrical power from the car. This could happen because the BMS system (***) controlling the car battery decided that the battery is now “fully charged” (****) now, and it is time to stop charging. It could also happen if an emergency safety condition was detected during the session that warranted immediate charging shutdown. Either way, the car is requesting to stop charging.<\/p>\n\n\n\n<p id=\"13bf\">(***) BMS — The car battery gets charged under full supervision of the Battery Management System. The BMS controls the rate at which the battery pack is charged, equalizing cell voltages and ensuring temperatures do not rise up dangerously, besides deciding when to stop charging.<\/p>\n\n\n\n<p id=\"6880\">(****) “Fully charged” — Most EV OEMs and Lithium Ion battery manufacturers typically set a guard band on the upper level of battery charge. Hence although it may display 100% on the dashboard, the real battery level would be somewhere in the 80% to 90% range.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"6441\"><strong>Rate of charging (or charging current)<\/strong><\/h2>\n\n\n\n<p id=\"eb60\">Ok, so how does the Charger know at what current to transfer power to the car in the charging session? As we saw earlier, the duty cycle of the square wave is utilized for this purpose. As we know, the duty cycle is 50% if the square wave is symmetrical.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*fadFrz2PXlAqkCFOxmYMsw.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">PWM with 50% Duty Cycle<\/figcaption><\/figure>\n\n\n\n<p id=\"c3eb\">As we increase the pulse width on the positive direction, it gets closer to 100%, where most of the time it has positive value.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*UQ659NLRFTFE4h1p63sV_g.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">PWM with 75% Duty Cycle<\/figcaption><\/figure>\n\n\n\n<p id=\"13d2\">Whereas if we increase the pulse width on the negative direction, it gets closer to 0%, where most of the time it has negative value.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*h0qK0y4YQ5EMaJJv7XA9pw.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">PWM with 25% Duty Cycle<\/figcaption><\/figure>\n\n\n\n<p id=\"2857\">The EV Charger therefore generates a square wave as per the IEC61851 Standard, to signal the charging current value. So, what is the correlation between the duty cycle of the square wave and the current? Here is where it involves a little bit of abracadabra!<\/p>\n\n\n\n<p id=\"9db8\">Firstly, the full range of current from 6A to 80A is split across 2 ranges:<br>Lower range: 6A to 51A<br>Upper range: 51A to 80A<\/p>\n\n\n\n<p id=\"a691\">Why this bizarre split range? We will see soon.<\/p>\n\n\n\n<p id=\"0f96\">Secondly, the formula in the lower range to convert duty cycle (%) to current (A) is<br><strong>A = Duty cycle (%) x 0.6<\/strong><\/p>\n\n\n\n<p id=\"fc3c\">However, the relation of current and duty cycle is not linear throughout the range.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*j2bTyKK5u4G3to5xhrbs8g.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Current Vs Duty Cycle<\/figcaption><\/figure>\n\n\n\n<p id=\"3a64\">The initial part of the curve has a relatively steep slope, with an increase of 6A for every 10% increase in duty cycle.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*lcO5ORr961u0SWk05KR48w.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Lower range (Current Vs Duty Cycle)<\/figcaption><\/figure>\n\n\n\n<p id=\"5cde\">At the inflection point of 51A, the curve changes to a milder slope. So that is what necessitates a split range.<\/p>\n\n\n\n<p id=\"11ca\">To accommodate for this gradient change, the formula in the second range (beyond 51 A) changes to&nbsp;<br><strong>A = (Duty cycle (%) — 64) x 2.5<\/strong><\/p>\n\n\n\n<p id=\"650a\">So, the remaining part of the curve has a milder slope, with an increase of 5A for every 2% increase in duty cycle.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1342\/1*tKuRIKgZYZJSX14GlEE3qg.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Upper range (Current Vs Duty Cycle)<\/figcaption><\/figure>\n\n\n\n<p id=\"93a7\">From this relation, we can see that&nbsp;<br>1) The valid range of duty cycle of the square wave is between 10% and 96%.&nbsp;<br>2) 10% duty cycle corresponds to 6A charging current.<br>3) 50% duty cycle (symmetrical square wave) corresponds 30 A charging current.<br>4) 96% duty cycle corresponds to 80A charging current.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"253e\"><strong>Connected or not<\/strong><\/h2>\n\n\n\n<p id=\"94d1\">Ok, now how does the car know that it is connected properly to the EV Charger or not? For safety it is very important that the car ‘knows’ that it is securely connected to the EV Charger.<\/p>\n\n\n\n<p id=\"5730\">Here is where the Proximity Pilot (PP) pin (also known as Plug Present) is useful. The Proximity Pilot in the plug serves this purpose by creating a circuit via a resistor to the Protective Earth (PE) pin. Firstly, if the connection is not proper it allows to disable the charging process for safety. Further, it helps prevent the user driving off accidentally with the charging gun inserted.<\/p>\n\n\n\n<p id=\"cbcc\">Thus, by applying a voltage to Proximity Pilot (PP) pin, the car detects a voltage drop when the charging gun is connected to its inlet as this will create an electric circuit. This provides a signal to the car’s control system to prevent any movement while being connected to the EV Charger. It provides an additional function (*****) of signalling the latch release (optional) button to the car, so that the car could initiate a controlled shut off prior to the electrical disconnection of the power pins.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*DUAjq6xn1AO5Jc_mkrSZXQ.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Connection State Vs PP Voltage<\/figcaption><\/figure>\n\n\n\n<p id=\"03c3\">At SFO Technologies (the flagship company of NeST group), we test our EV Charger designs using a Battery Communications Simulator. The Simulator presents an identical interface of the car, and works exactly like a car. It provides an identical connector and pinout just like a CCS2 compliant car. It works on the same Analog Signalling protocol, mimicking exact voltages, waveforms and timing characteristics as defined by the IEC61851 standard, that the EV Charger thinks it is connected to a real car! This standards compliance of the design ensures it will work correctly with any compliant car model.<\/p>\n\n\n\n<p id=\"2fd8\">(*****) Additional function — The PP pin also includes a legacy function of detecting the capacity of charging cables that are not tethered to the EV Charger, and hence their current capacity is unknown to the EV Charger. To ensure safe charging, it first makes sure that the cable has enough capacity for the current that it is planning to supply before actually transferring power. For this the resistance value on the PP line is adjusted such that the current flowing when measured gives an indication of the cable’s capacity. This function is not relevant nowadays, since the charging cable is an integral part of the EV Charger and hence its capacity is already known.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/miro.medium.com\/v2\/resize:fit:1400\/1*mj8kIgMZRXh7_OU8G4W63Q.png\" alt=\"\"\/><figcaption class=\"wp-element-caption\">Power cable capacity Vs PP Resistance<\/figcaption><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"2370\"><strong>To be continued…<\/strong><\/h2>\n\n\n\n<p id=\"3a87\">In all of this communication by raw voltages, waveforms and their timings that starts as soon as the car is plugged in, one cannot simply miss the ingenuity of the protocol at the basic electrical level — simple, yet functional! Analog Signalling is implemented entirely at the hardware level, using simple electronic circuitry consisting of discrete\/analog components and mixed signal ICs. The average software engineer could understandably be left shrugging at all those voltage levels and waveforms, while it’s pure delight for the hardware engineer! I promise I will make the next (second) part on High Level Communication equally (or more) exciting for the software engineer as well.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Abstract Electric car users need to frequently recharge the traction battery, and while doing so they need to be assured of an efficient, safe and interoperable experience, be it AC charging or DC charging. EV Charging standards assure users that they can charge their car from any compatible EV Charger. Apart from electrical protection that [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":5673,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":"","wds_primary_category":16},"categories":[16],"tags":[35],"blocksy_meta":"","_links":{"self":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts\/4524"}],"collection":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/comments?post=4524"}],"version-history":[{"count":0,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/posts\/4524\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/media\/5673"}],"wp:attachment":[{"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/media?parent=4524"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/categories?post=4524"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/nestdigital.com\/wp-json\/wp\/v2\/tags?post=4524"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}